Урок 1. Контрольная работа
Данная работа необходима для проверки ваших знаний и навыков по итогу прохождения первого блока обучения на программе Разработчик. Мы должны убедится, что базовое знакомство с IT прошло успешно.

Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо:

1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []

Загрузите задание на проверку до 6 окт., 12:00 +03:00 UTC

string[] initialArray = new string [8] {"458", "72", "student", "sol", "song", "256",  "dog", "data"};

string[] resultingArray = new string[initialArray.Length];

string[]NewArrayOfStrings(string[] initialArray, string[] resultingArray)
{
    int temp = 0;
    for (int i = 0; i < initialArray.Length; i++)
    {
    if(initialArray[i].Length <= 3)
        {
        resultingArray[temp] = initialArray[i];
        temp++;
        }
    }
    return resultingArray;
}

void PrintArray(string[] array)
{
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"{array[i]}  ");
    }
    Console.WriteLine();
}

Console.WriteLine("Исходный массив");
Console.WriteLine("458  72  student  sol  song  256  dog  data");

Console.WriteLine();
Console.WriteLine("Задача: ");
Console.WriteLine("Получить новый массив из строк, длина которых меньше, либо равна 3 символам.");

Console.WriteLine();
Console.WriteLine("Полученный массив");

resultingArray = NewArrayOfStrings(initialArray, resultingArray);
PrintArray(resultingArray);
